#+TITLE: GUIX Shell examples
#+OPTIONS: toc:2
#+STARTUP: show3levels

Running a [[https://guix.gnu.org/][GNU Guix]] system as main operating system generally works for me. However, I have the requirement to run some software that is not available in Guix. Although it's generally possible (but not the Guix-way) to create packages from proprietary software, where source code is unavailable, creating a Guix package is not trivial or not feasible in some cases.

I use this file to describe and finally extract my frequently used Guix shell calls into separate script files to my ~$HOME/.local/bin/~ directory (which is part of my ~$PATH~), by using the ~org-babel-tangle-file~ function of Emacs's wonderful [[https://orgmode.org/][org mode]].

** Java versions in GNU Guix

In GNU Guix there is a broad range of versions of Open Source Java implementations, namely JDKs (Java Development Kits) and their respective JREs (Java Runtime Environments) available.

Versions (9+) of OpenJDK are available via package ~openjdk~. As of [2023-11-11 Sat], these are:

#+begin_src shell :exports both
  guix show openjdk | grep version
#+end_src

#+RESULTS:
| version: |      21 |
| version: |      20 |
| version: |  19.0.2 |
| version: |  18.0.2 |
| version: |  17.0.5 |
| version: |  16.0.2 |
| version: |  15.0.9 |
| version: |  14.0.2 |
| version: | 13.0.13 |
| version: |   12.33 |
| version: | 11.0.17 |
| version: |   10.46 |
| version: |   9.181 |

The available ~icedtea~ packages are:

#+begin_src shell :exports both
  guix show icedtea | grep version
#+end_src

#+RESULTS:
| version: | 3.19.0 |
| version: | 2.6.13 |

Java 1.8 is provided by the package ~icedtea~ version 3.19.0:

  #+begin_src shell :prologue "exec 2>&1" :epilogue ":" :exports both
    guix shell icedtea@3.19.0 -- java -version
  #+end_src

  #+RESULTS:
  : openjdk version "1.8.0_292"
  : OpenJDK Runtime Environment (IcedTea 3.19.0) (guix build 1.8.0_292-b10)
  : OpenJDK 64-Bit Server VM (build 25.292-b10, mixed mode)

Java 1.7 is provided in the package ~icedtea~ version 2.6.13:

  #+begin_src shell :prologue "exec 2>&1" :epilogue ":" :exports both 
    guix shell icedtea@2.6.13 -- java -version
  #+end_src 

  #+RESULTS:
  : java version "1.7.0_171"
  : OpenJDK Runtime Environment (IcedTea 2.6.13) (linux-gnu build 1.7.0_171-b02)
  : OpenJDK 64-Bit Server VM (build 24.171-b02, mixed mode)


Unfortunately, in most cases it is not sufficient to just install a recent version of OpenJDK. Furthermore this does not allow for different versions to exist in parallel. A simple ~guix shell~ with the appropriate package added, does also not suffice, as the following examples demonstrate. Especially with desktop programs additional tweaks are required.

However, a basic shell with OpenJDK 17 (JDK) is started with:

#+begin_src shell :shebang #!/bin/sh :tangle ~/.local/bin/guix-shell-java17.sh
  export JAVA_HOME=$(guix build openjdk@17.0.5 | grep "\-jdk$")
  guix shell openjdk@17.0.5:jdk
#+end_src

*** TODO JabRef
[[https://www.jabref.org/][JabRef]] is also available as flatpak, but I preferred to create a Guix shell for it. So I downloaded and extracted a recent version. This is the file I wanted to run:

#+begin_src shell :exports both
  ls -l ~/Applications/JabRef-5.11/bin/JabRef
  file ~/Applications/JabRef-5.11/bin/JabRef
#+end_src

#+RESULTS:
: -rwxr-xr-x 1 flake users 18568 Oct 22 01:05 /home/flake/Applications/JabRef-5.11/bin/JabRef
: /home/flake/Applications/JabRef-5.11/bin/JabRef: ELF 64-bit LSB pie executable, x86-64, version 1 (SYSV), dynamically linked, interpreter /lib64/ld-linux-x86-64.so.2, for GNU/Linux 2.6.18, BuildID[sha1]=6d790541a31635bd38177b4f4d70bcdf422eb827, not stripped

But this does not work as expected:

#+begin_src shell :prologue "exec 2>&1" :epilogue ":" :exports both
  guix shell openjdk@17.0.5 -- ~/Applications/JabRef-5.11/bin/JabRef
#+end_src

#+RESULTS:
: guix shell: error: /home/flake/Applications/JabRef-5.11/bin/JabRef: command not found

Running in a container that complies with the File Hierarchy System (FHS) solves the issue for me. However the container needs additional information and programs to smoothly run JabRef.

- Without ~xdg-user-dirs~, JabRef complains:
  #+begin_src
    ERROR: Error while executing xdg-user-dir: java.io.IOException: Cannot run program "xdg-user-dir": error=2, No such file or directory
  #+end_src
  So I added ~xdg-user-dirs~ to the container and preserved ~XDG_~ environment variables.
- To open links in an external program, JabRef uses ~xdg-open~. Therefore I added ~xdg-utils~.
- I added ~ungoogled-chromium~ to allow JabRef to open internet URLs. Since I am on Wayland, I configured my own chromium profile to use Wayland. JabRef itself runs as X11 application in XWayland. That's why I had to add both environments (Wayland and X) to the container.

#+begin_src shell :shebang #!/bin/sh :tangle ~/.local/bin/guix-shell-jabref.sh

  guix shell \
       --container --emulate-fhs --network \
       --preserve='^DBUS_' --expose=/var/run/dbus \
       --preserve='^XDG_|^WAYLAND_DISPLAY$' --expose=/run/user \
       --preserve='^DISPLAY$' --expose=/dev/dri --expose=/sys/dev --expose=/sys/devices \
       --share=$HOME \
       coreutils gtk+ openjdk@17.0.5 xdg-utils xdg-user-dirs ungoogled-chromium \
       -- ~/Applications/JabRef-5.11/bin/JabRef

#+end_src

